case/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         CrankNicolson 0.5;
}

gradSchemes
{
    default         Gauss linear;

}

divSchemes
{
    default          Gauss linear;
    div(phi,U)       Gauss vanLeer;
    div(SigmaP)	     Gauss midPoint corrected;
    div(SigmaL)      Gauss midPoint corrected;
    div(phi,et)      Gauss vanLeer;
    div(jflux)       Gauss midPoint corrected;


}

laplacianSchemes
{
    default         Gauss linear corrected;

}

interpolationSchemes
{
    default         linear corrected;
}

snGradSchemes
{
    default         orthogonal;
}



// ************************************************************************* //
